import { Card } from '@/src/types/cards';

export const CARDS_BT10: Card[] = [
  {
    name: 'ชิโยเมะ นินจาสาว',
    type: 'Avatar',
    soi: 3,
    print: 'BT10-006',
    rare: 'R',
    mainEffect:
      'สั่งใช้ จากบนมือ ใน Main Phase ผู้เล่นใดก็ได้ : เลือก Avatar "นินจา" 1 ใบ ที่ไม่ได้ชื่อ ชิโยเมะ นินจาสาว บน Avatar Zone เรา นำกลับขึ้นมือ และ อัญเชิญ การ์ดใบนี้ลงบน Avatar Zone ฝ่ายเรา สามารถอัญเชิญ ชิโยเมะ นินจาสาว ด้วยวิธีนี้ ได้เพียง 1 ครั้งต่อ 1 เทิร์น เท่านั้น\nอัตโนมัติ เมื่อ Avatar ใบนี้ถูกอัญเชิญด้วยความสามารถตัวเอง : เลือก Avatar บน Avatar Zone ฝ่ายตรงข้าม 1 ใบ POWER -3 จนจบเทิร์นนั้น',
    cost: 2,
    gem: 3,
    power: 2,
    symbol: 'ต่างชาติ',
    color: 'แดง',
  },
  {
    name: "สิ่งปฏิกูลมีชีวิต",
    type: "Avatar",
    soi: 3,
    print: "BT10-017",
    rare: "C",
    mainEffect:
      `คำสั่งเสีย : สอดแนม 3 ใบ เลือก Avatar "สิ่งปฏิกูล" 1 ใบ จากที่ สอดแนม นำขึ้นมือ การ์ดที่เหลือ ส่งลง นรก ถ้าความสามารถนี้ทำงานในเทิร์นของเรา อัญเชิญ Avatar ที่เลือกลงบน Avatar Zone เราแทน`,
    cost: 1,
    gem: 1,
    power: 1,
    symbol: "สัตว์มหัศจรรย์",
    color: "ฟ้า",
  },
  {
    name: "สิ่งปฏิกูลสีเงิน",
    type: "Avatar",
    soi: 3,
    print: "BT10-018",
    rare: "C",
    mainEffect:
      `คำสั่งเสีย : เลือก Avatar 1 ใบ บน Avatar Zone ฝ่ายตรงข้าม Avatar ใบที่เลือก POWER -1 ถ้าความสามารถนี้ทำงานในเทิร์นของเรา Avatar ใบที่เลือก POWER -3 แทน`,
    cost: 1,
    gem: 1,
    power: 1,
    symbol: "สัตว์มหัศจรรย์",
    color: "ฟ้า",
  },
  {
    name: "ราชาสิ่งปฏิกูล",
    type: "Avatar",
    soi: 3,
    print: "BT10-019",
    rare: "C",
    mainEffect:
      `พอดี จุตี : ถ้า นรกเรา มี การ์ด "สิ่งปฏิกูล" ตั้งแต่ 5 ใบขึ้นไป เลือก Avatar ของฝ่ายตรงข้าม 1 ใบ เปลี่ยน Symbol ของ Avatar ใบนั้นเป็น {symbol สัตว์มหัศจรรย์} และเปลี่ยนชื่อของ Avatar ใบนั้นเป็น "สิ่งปฏิกูล" และมี POWER 1
      อัตโนมัติ ถ้า Avatar ใบนี้ถูกอัญเชิญมาด้วยความสามารถของการ์ด "สิ่งปฏิกูล" : ทำความสามารถ พอดี จุตี
      เทิร์นละครั้ง สั่งใช้ : ทำลาย "สิ่งปฏิกูล" 1 ใบ บน Avatar Zone ผู้เล่นใดก็ได้ ถ้าทำลายสำเร็จ สุ่มทิ้งการ์ดบนมือ ผู้เล่นฝ่ายตรงข้าม 1 ใบ`,
    cost: 5,
    gem: 2,
    power: 4,
    symbol: "สัตว์มหัศจรรย์",
    color: "ฟ้า",
  },
  {
    name: 'ผู้คุมกฎแห่งภาคีมะม่วง',
    type: 'Avatar',
    soi: 3,
    print: 'BT10-040',
    rare: 'UR',
    mainEffect:
      'จุติ : นำ Avatar "มะม่วง" ที่เป็น {symbol ต้นไม้} และไม่ใช่ {only} 1 ใบ จาก Deck มาวางไว้บน Magic Zone ฝ่ายเรา ถ้า Avatar ใบนั้นคือ ต้นมะม่วง สามารถนำ "มะม่วง" ที่เป็น {symbol ต้นไม้} อีก 1 ใบ จาก Deck หรือ นรก มาวางไว้ บน Magic Zone ฝ่ายเรา จากนั้น สับ Deck\nคำสั่งเสีย ถ้าถูกทำลายจากการ์ดฝ่ายตรงข้ามหรือการ์ด "มะม่วง" นำการ์ดใบนี้ ไปวางไว้บน Magic Zone เรา',
    cost: 5,
    gem: 1,
    power: 4,
    symbol: 'ต้นไม้',
    color: 'เขียว',
  },
  {
    name: 'ราชันย์ตั๊กแตนศตวรรษ',
    type: 'Avatar',
    soi: 3,
    print: 'BT10-044',
    rare: 'SR',
    mainEffect:
      'จุติ เลือกปฏิบัติ :\n1) นำ "บัลลังก์ตั๊กแตนศตวรรษ" 1 ใบจากนรกเรา มาสวมใส่การ์ดใบนี้\n2) หงาย LIFE Card ใบบนสุด ของฝ่ายเรา 1 ใบ นำ "บัลลังก์ตั๊กแตนศตวรรษ" 1 ใบ จาก Deck ขึ้นมือ จากนั้นสับ Deck\nต่อเนื่อง เมื่อ Avatar ใบนั้น สวมใส่ "บัลลังก์ตั๊กแตนศตวรรษ" จะได้รับ\n{red "อัตโนมัติ ในช่วงเริ่ม Main Phase เราเลือก LIFE Card ที่หงายอยู่ของเรา 1 ใบ : ใช้ผลความสามารถการ์ดที่เลือก จนจบเทิร์น หากความสามารถนั้น ระบุว่า "ใน Main Phase ถัดไป" ให้ทำความสามารถในเทิร์นนี้"}',
    cost: 4,
    gem: 3,
    power: 2,
    symbol: 'แมลง',
    color: 'เขียว',
  },
  {
    name: "ทะลวงส้วม",
    type: "Magic",
    subtype: "Normal",
    cost: 1,
    print: "BT10-062",
    soi: 3,
    symbol: "จอมเวทย์",
    mainEffect:
      `เซ่นไหว้ Avatar "สิ่งปฏิกูล" 1 ใบ : จั่วการ์ด 3 ใบ จากนั้นทิ้งการ์ดบนมือ 1 ใบ`,
    rare: "C",
  }
]