import type { Card } from "@/src/types/cards";

export const CARDS_BT11: Card[] = [
  {
    name: "ฤาษีอังคต",
    type: "Avatar",
    soi: 3,
    print: "BT11-001",
    rare: "C",
    mainEffect: `เทิร์นละครั้ง อัตโนมัติ เมื่อ เราใช้ Magic {Symbol ฤษี} : เลือก Avatar {symbol สัตว์} 1 ใบ บน Avatar Zone ถ้า Avatar ใบที่เลือกเป็นของฝ่ายตรงข้าม ทำลาย Avatar ใบนั้น ถ้า Avatar ใบที่เลือกเป็นของเรา Avatar ใบนั้นได้รับ POWER +2 และ สามัคคี จนจบเทิร์น`,
    cost: 4,
    gem: 2,
    power: 3,
    symbol: "ฤษี",
    color: "แดง",
  },
  {
    name: "ลุกซุเรีย โปรดิวเซอร์ปีศาจ",
    type: "Avatar",
    soi: 3,
    print: "BT11-026",
    cost: 8,
    power: 3,
    gem: 2,
    symbol: "นรก",
    rare: "SR",
    color: "ม่วง",
    mainEffect: `สั่งใช้ จากบนมือ โดยการส่ง การ์ด "โอตะ" ได้มากสุด 3 ใบ (อย่างน้อย 1) จากบนสนามผู้เล่นใดก็ได้ลงนรก : อัญเชิญการ์ดใบนี้และ การ์ดใบนี้จะ POWER +1 ตามจำนวนการ์ด "โอตะ" ที่ถูกส่งไป
    เทิรน์ละครั้ง สั่งใช้ ส่งการ์ด "โอตะ" 1 ใบ จากบนสนามผู้เล่นใดก็ได้ลงนรก : POWER +2 จนจบเทิร์นฃ
    เทิรน์ละครั้ง อัตโนมัติ เมื่อโจมตี เลือกการ์ด "โอตะ" 1 ใบ จากนรกเรา : นำการ์ดที่เลือกมาสวมใส่การ์ดใบนี้`,
  },
  {
    name: "YaiMakMak",
    type: "Avatar",
    soi: 3,
    print: "BT11-028",
    rare: "SR",
    mainEffect: `จุติ : อัญเชิญ Avatar "สมาชม" 1 ใบ จากใน Deck ลง Avatar Zone เราจากนั้นสับ Deck
    เทิรน์ละครั้ง สั่งใช้ ถ้าบน Avatar Zone เรา มี Avatar "สมาชม" 2 ใบ ขึ้นไป : ทำลาย Avatar Cost 4 หรือต่ำกว่า ของฝ่ายตรงข้าม 1 ใบ ต่อจนวน Avatar "สมาชม" ใบอื่นบน Avatar Zone เรา Cost ที่สามารถทำลายได้จากความสามารถนี้จะ -1
    ต่อเนื่อง เราสามารถควบคุม Yaimakmak ใน Avatar Zone ได้เพียง 1 ใบเท่านั้น
    #Avatar ใบนี้ ถือว่ามีชื่อ "สมาชม"`,
    cost: 4,
    gem: 0,
    power: 5,
    symbol: "คน",
    color: "ม่วง",
    ex: "โดนใจ",
  },
  {
    name: "YaiMakMak",
    type: "Avatar",
    soi: 3,
    print: "BT11-028",
    rare: "SCR",
    mainEffect: `จุติ : อัญเชิญ Avatar "สมาชม" 1 ใบ จากใน Deck ลง Avatar Zone เราจากนั้นสับ Deck
    เทิรน์ละครั้ง สั่งใช้ ถ้าบน Avatar Zone เรา มี Avatar "สมาชม" 2 ใบ ขึ้นไป : ทำลาย Avatar Cost 4 หรือต่ำกว่า ของฝ่ายตรงข้าม 1 ใบ ต่อจนวน Avatar "สมาชม" ใบอื่นบน Avatar Zone เรา Cost ที่สามารถทำลายได้จากความสามารถนี้จะ -1
    ต่อเนื่อง เราสามารถควบคุม Yaimakmak ใน Avatar Zone ได้เพียง 1 ใบเท่านั้น
    #Avatar ใบนี้ ถือว่ามีชื่อ "สมาชม"`,
    cost: 4,
    gem: 0,
    power: 5,
    symbol: "คน",
    color: "ม่วง",
    ex: "โดนใจ",
  },
  {
    name: "แอชลีย์",
    type: "Avatar",
    soi: 3,
    print: "BT11-029",
    rare: "C",
    mainEffect: `แทงหลัง
    เทิร์นละครั้ง สั่งใช้ ถ้าบน Avatar Zone เรามี Avatar "สมาชม" 2 ใบขึ้นไป ทิ้งการ์ดบนมือ 1 ใบ : ฝ่ายตรงข้าม เลือก Avatar 1 ใบ ในนรกฝ่ายตรงข้าม อัญเชิญ Avatar ใบนั้นลงบน Avatar Zone เรา และเปลี่ยนความสามารถของ Avatar ใบนั้นเป็น {red "อัตโนมัติ ในช่วง End Phase : ส่ง Avatar ใบนี้ลงนรก"}
    ต่อเนื่อง เราสามารถควบคุม แอชลีย์ ใน Avatar Zone ได้เพียง 1 ใบเท่านั้น
    #Avatar ใบนี้ ถือว่ามีชื่อ "สมาชม"`,
    cost: 4,
    gem: 1,
    power: 2,
    symbol: "คน",
    color: "ม่วง",
    ex: "โดนใจ",
  },
  {
    name: "แอชลีย์",
    type: "Avatar",
    soi: 3,
    print: "BT11-029",
    rare: "SCR",
    mainEffect: `แทงหลัง
    เทิร์นละครั้ง สั่งใช้ ถ้าบน Avatar Zone เรามี Avatar "สมาชม" 2 ใบขึ้นไป ทิ้งการ์ดบนมือ 1 ใบ : ฝ่ายตรงข้าม เลือก Avatar 1 ใบ ในนรกฝ่ายตรงข้าม อัญเชิญ Avatar ใบนั้นลงบน Avatar Zone เรา และเปลี่ยนความสามารถของ Avatar ใบนั้นเป็น {red "อัตโนมัติ ในช่วง End Phase : ส่ง Avatar ใบนี้ลงนรก"}
    ต่อเนื่อง เราสามารถควบคุม แอชลีย์ ใน Avatar Zone ได้เพียง 1 ใบเท่านั้น
    #Avatar ใบนี้ ถือว่ามีชื่อ "สมาชม"`,
    cost: 4,
    gem: 1,
    power: 2,
    symbol: "คน",
    color: "ม่วง",
    ex: "โดนใจ",
  },
  {
    name: "คุณคำดี",
    type: "Avatar",
    soi: 3,
    print: "BT11-031",
    rare: "R",
    mainEffect: `จุติ : อัญเชิญ Avatar "สมาชม" 1 ใบ จากใน Deck ลง Avatar Zone จากนั้นสับ Deck
    อัตโนมัติ เมื่อโจมตี ถ้าบน Avatar Zone เรามี Avatar "สมาชม" 2 ใบขึ้นไป : POWER +1 ต่อจำนวน Avatar ในนรก ทุกๆ 2 ใบ จนจบการต่อสู้
    ต่อเนื่อง Avatar ทุกใบบน Avatar Zone เรา POWER -1
    ต่อเนื่อง เราสามารถควบคุม คุณคำดี ใน Avatar Zone ได้เพียง 1 ใบเท่านั้น
    #Avatar ใบนี้ ถือว่ามีชื่อ "สมาชม"`,
    cost: 4,
    gem: 1,
    power: 3,
    symbol: "คน",
    color: "ม่วง",
    ex: "โดนใจ",
  },
  {
    name: "คุณคำดี",
    type: "Avatar",
    soi: 3,
    print: "BT11-031",
    rare: "SCR",
    mainEffect: `จุติ : อัญเชิญ Avatar "สมาชม" 1 ใบ จากใน Deck ลง Avatar Zone จากนั้นสับ Deck
    อัตโนมัติ เมื่อโจมตี ถ้าบน Avatar Zone เรามี Avatar "สมาชม" 2 ใบขึ้นไป : POWER +1 ต่อจำนวน Avatar ในนรก ทุกๆ 2 ใบ จนจบการต่อสู้
    ต่อเนื่อง Avatar ทุกใบบน Avatar Zone เรา POWER -1
    ต่อเนื่อง เราสามารถควบคุม คุณคำดี ใน Avatar Zone ได้เพียง 1 ใบเท่านั้น
    #Avatar ใบนี้ ถือว่ามีชื่อ "สมาชม"`,
    cost: 4,
    gem: 1,
    power: 3,
    symbol: "คน",
    color: "ม่วง",
    ex: "โดนใจ",
  },
  {
    name: "น้าแมน",
    type: "Avatar",
    soi: 3,
    print: "BT11-030",
    rare: "R",
    mainEffect: `เทิร์นละครั้ง สั่งใช้ถ้าบน Avatar Zone เรามี Avatar "สมาชม" 2 ใบขึ้นไป เลือก Avatar บน Avatar Zone เรา และ ฝ่ายตรงข้าม อย่างละ 1 ใบ : เปลี่ยน สภาพ Avatar ใบที่เลือก
ต่อเนื่อง เราสามารถควบคุม น้าแมน ใน Avatar Zone ได้เพียง 1 ใบเท่านั้น
#Avatar ใบนี้ ถือว่ามีชื่อ "สมาชม"`,
    cost: 4,
    gem: 4,
    power: 1,
    symbol: "คน",
    color: "ม่วง",
    ex: "โดนใจ",
  },
  {
    name: "น้าแมน",
    type: "Avatar",
    soi: 3,
    print: "BT11-030",
    rare: "SCR",
    mainEffect: `เทิร์นละครั้ง สั่งใช้ถ้าบน Avatar Zone เรามี Avatar "สมาชม" 2 ใบขึ้นไป เลือก Avatar บน Avatar Zone เรา และ ฝ่ายตรงข้าม อย่างละ 1 ใบ : เปลี่ยน สภาพ Avatar ใบที่เลือก
ต่อเนื่อง เราสามารถควบคุม น้าแมน ใน Avatar Zone ได้เพียง 1 ใบเท่านั้น
#Avatar ใบนี้ ถือว่ามีชื่อ "สมาชม"`,
    cost: 4,
    gem: 4,
    power: 1,
    symbol: "คน",
    color: "ม่วง",
    ex: "โดนใจ",
  },
  {
    name: "แยกกันไปแตก",
    type: "Magic",
    soi: 3,
    print: "BT11-054",
    rare: "R",
    mainEffect: `สามารถใช้ได้เมื่อบน Avatar Zone ฝ่ายเรามี Avatar "สมาชม" ชื่อไม่ซ้ำกัน 4 ใบ เลือกปฏิบัติ :
1) เนรเทศ Avatar "สมาชม" ชื่อแตกต่างกันในนรกเรา 4 ใบ : อีกฝ่ายทิ้งการ์ดบนมือทั้งหมด
2) เนรเทศ Avatar "สมาชม" ชื่อแตกต่างกันในนรกเรา 4 ใบ : ทำลาย Avatar บนสนามฝ่ายตรงข้ามทั้งหมด`,
    cost: 0,
    symbol: "คน",
    ex: "โดนใจ",
    subtype: "Normal",
  },
  {
    name: "นักท่องเรื่องราว มายา",
    type: "Avatar",
    soi: 3,
    print: "BT11-048",
    rare: "UR",
    mainEffect: `สั่งใช้ แสดง Avatar "เรื่องราว" Cost 6 1 ใบจากบนมือ : เนรเทศ Avatar ใบนี้ และอัญเชิญ การ์ดใบที่แสดง ลงบน Avatar Zone ฝ่ายเรา สามารถใช้ความสามารถนี้ใน Battle Phase ฝ่ายเราได้ และ Avatar ที่ถูกอัญเชิญด้วยความสามารถการ์ดใบนี้ จะมี POWER +1`,
    cost: 4,
    gem: 2,
    gemColor: "เขียว",
    power: 3,
    symbol: "ต่างชาติ",
    color: "เขียว",
  },
  {
    name: "มายา เรื่องราว เทพเจ้าสายฟ้า",
    type: "Avatar",
    soi: 3,
    print: "BT11-049",
    rare: "C",
    mainEffect: `อัตโนมัติ ถ้า Avatar ใบนี้ถูก อัญเชิญมาด้วยความสามารถของ "นักท่องเรื่องราว" : จะได้รับความสามารถต่อไปนี้
  {red "อัตโนมัติ เมื่อการ์ดใบนี้ถูกอัญเชิญ : นำ Magic "Skill" 1 ใบจาก Deck ขึ้นมือจากนั้นสับ Deck
  อัตโนมัติ เทิร์นละครั้ง ในเทิร์นเมื่อเราใช้ Magic : Avatar ในนี้ POWER +1"}`,
    cost: 6,
    gem: 1,
    gemColor: "เขียว",
    power: 3,
    symbol: "หุ่นยนต์",
    color: "เขียว",
  },
  {
    name: "เซอร์นัท ผู้นำแห่งอัศวินตลิ่งชัน",
    type: "Avatar",
    soi: 3,
    print: "BT11-003",
    rare: "UR",
    mainEffect: `จุติ : นำ "ไอ้นัท" 1 ใบ จากนรกเรามาสวมใส่การ์ดใบนี้
เทิร์นละครั้ง สั่งใช้ ในเทิร์นใครก็ได้ เมื่อฝ่ายตรงข้ามใช้ความสามารถการ์ด และ Avatar Zone เรา มีเพียง Avatar "อัศวินตลิ่งชัน" , "เซอร์นัท" หรือ "ไอ้นัท" เท่านั้น โดยการ เนรเทศ การ์ด 2 ใบ ที่การ์ดใบนี้สวมใส่อยู่ : ยกเลิกความสามารถของการ์ดใบนั้น
ต่อเนื่อง POWER +1 ตามจำนวนการ์ดที่สวมใส่อยู่และ ถ้า Avatar ใบนี้ สวมใส่ "ไอ้นัท" อยู่ จะได้รับ ความสามารถของการ์ด "ไอ้นัท" ทั้งหมดที่สวมใส่อยู่ด้วย`,
    cost: 5,
    gem: 1,
    power: 3,
    symbol: "คน",
    color: "แดง",
  },
  {
    name: "มือปืนนคร บ่าวจุ้ย",
    type: "Avatar",
    soi: 3,
    print: "BT11-004",
    rare: "UR",
    mainEffect: `เทิร์นละครั้ง สั่งใช้ เมื่อจบการต่อสู้ที่ Avatar ใบนี้โจมตี เนรเทศ "อาวุธพระนคร" ที่ Avatar ใบนี้สวมใส่ 1 ใบ และนำ "อาวุธพระนคร" ที่ชื่อต่างกับใบที่ เนรเทศ ไปด้วยความสามารถนี้ 1 ใบ  จากมิติมืด มาสวมใส่ให้ Avatar ใบนี้ : เปลี่ยน Avatar ใบนี้เป็น สภาพตื่น สามารถใช้ความสามารถนี้ได้เมื่อบน Construct Zone เรามี นครทิเนนทอล อยู่เท่านั้น
    ต่อเนื่อง Avatar ใบนี้ ไม่สามารถสวมใส่ "อาวุธนคร" ที่มีชื่อเดียวกันได้
#สามารถควบคุม มือปืนนคร บ่าวจุ้ย ใน Avatar Zone ได้เพียง 1 ใบเท่านั้น`,
    cost: 4,
    gem: 2,
    gemColor: "แดง",
    power: 4,
    symbol: "คน",
    color: "แดง",
  },
  {
    name: "อาเมอร์ ทศกัณท์",
    type: "Avatar",
    soi: 3,
    print: "BT11-042",
    rare: "UR",
    mainEffect: `จุติ : สอดแนม 5 ใบ อัญเชิญ Avatar {Symbol ยักษ์} POWER 3 หรือ "ทศกัณท์" 1 ใบจากที่ สอดแนม ลง Avatar Zone เรา การ์ดที่เหลือกลับเข้า Deck แล้วสับ
ต่อเนื่อง ถ้า Avatar Zone เรามี Avatar {Symbol ยักษ์} ใบอื่น หรือ "มณโฑ" Avatar ใบนี้ POWER +2
ต่อเนื่อง ถ้า Avatar Zone เราไม่มี Avatar {Symbol ยักษ์} ใบอื่น Avatar ใบนี้ POWER -2`,
    cost: 4,
    gem: 1,
    gemColor: "เขียว",
    power: 3,
    symbol: "ยักษ์",
    color: "เขียว",
  },
  {
    name: "พระถังซัมจั๋ง",
    type: "Avatar",
    soi: 3,
    print: "BT11-047",
    rare: "UR",
    mainEffect: `จุติ ทิ้งการ์ด Avatar 1 ใบ : อัญเชิญ ซุนหงอคง, ตือโป๊ยก่าย หรือ ซัวเจ๋ง 1 ใบ จาก Deck ลงบน Avatar Zone ฝ่ายเรา จากนั้นสับ Deck
  เทิร์นละครั้ง สั่งใช้ กำบน Avatar Zone ฝ่ายเรา มี ซุนหงอคง, ตือโป๊ยก่าย และ ซัวเจ๋ง : นำพระไตรปิฎก 1 ใบ จาก Deck หรือ นรก ขึ้นมือ ถ้านำจาก Deck ให้สับ Deck`,
    cost: 4,
    gem: 4,
    power: 0,
    symbol: "ต่างชาติ",
    color: "เขียว",
  },
  {
    name: "กิมมิคแมน",
    type: "Avatar",
    soi: 3,
    print: "BT11-007",
    rare: "R",
    mainEffect: `จุติ : สอดแนม 3 ใบ แล้วให้ฝ่ายตรงข้าม สุ่มเลือกการ์ด 1 ใบ จากที่ สอดแนม แสดงการ์ดใบที่เลือก และนำขึ้นมือเรา การ์ดที่เหลือนำกลับเข้า Deck แล้วสับ`,
    cost: 4,
    gem: 2,
    power: 4,
    symbol: "คน",
    color: "แดง",
  },
  {
    name: "ออส่วนบอย",
    type: "Avatar",
    soi: 3,
    print: "BT11-008",
    rare: "C",
    mainEffect: `อัตโนมัติ เมื่อ "กิมมิคแมน" บน Avatar Zone เรา ถูกทำลายในเทิร์นฝ่ายตรงข้าม : ปรับ POWER ตั้งต้น การ์ดใบนั้น 6
[Link กิมมิคแมน]
ต่อเนื่อง ฝ่ายตรงข้ามไม่สามารถเลือกเป้าโจมตีอื่นนอกจาก "กิมมิคแมน"`,
    cost: 3,
    gem: 3,
    power: 1,
    symbol: "คน",
    color: "แดง",
  },
  {
    name: "มิสทรอม่า",
    type: "Avatar",
    soi: 3,
    print: "BT11-011",
    rare: "R",
    mainEffect: `จุติ : ทำลายการ์ด {land} 1 ใบที่เป็นของฝ่ายตรงข้ามบน Land Magic Zone และใช้ {land} "ดินแดนยุติธรรม" 1 ใบจาก Deck เรา และ สับ Deck จากนั้นจนกว่าจะจบเทิร์นต่อไปของฝ่ายตรงข้าม ผู้เล่นฝ่ายตรงข้ามไม่สามารถใช้ {land} ได้
    ต่อเนื่อง ตราบเท่าที่ Avatar Zone เรามี Avatar ที่อยู่ในสถานะ [Link] Avatar ใบนี้ POWER +1 ถ้า Avatar ที่อยู่ในสถานะ [Link] นั้นคือ "เพมมุ" และ "สไปรท์" POWER +2 แทน`,
    cost: 3,
    gem: 2,
    power: 2,
    symbol: "เอเลี่ยน",
    color: "แดง",
  },
  {
    name: "พิเภก",
    type: "Avatar",
    soi: 3,
    print: "BT11-043",
    rare: "R",
    mainEffect: `เทิร์นละครั้ง สั่งใช้ นำ Avatar {Symbol ยักษ์} POWER 3 จำนวน 1 ใบ จากในนรก กลับเข้า Deck จากนั้นสับ Deck : จั่วการ์ด 1 ใบ`,
    cost: 3,
    gem: 2,
    gemColor: "เขียว",
    power: 3,
    symbol: "ยักษ์",
    color: "เขียว",
  },
  {
    name: "ทำไมถึงเอาแต่ดูละครับ ?!",
    type: "Magic",
    soi: 3,
    print: "BT11-063",
    rare: "SR",
    mainEffect: `เมื่อฝ่ายตรงข้ามโจมตี : เลือก Avatar 1 ใบบน Avatar Zone ฝ่ายเรา ที่อยู่ในสถานะ [Link] เปลี่ยนเป้าหมายการโจมตี ไปยัง Avatar ใบที่เลือก จากนั้น Avatar ใบที่เลือก POWER +3 จนจบเทิร์น
#เมื่อการ์ดใบนี้ถูกใช้เป็นค่า Cost เพื่อการอัญเชิญ Avatar ที่มีความสามารถ [Link] การ์ดใบนี้จะถือว่ามี GEM 4 ไร้สี`,
    cost: 3,
    symbol: "จอมเวทย์",
    subtype: "React",
  },

];
